import {Component, OnInit, ViewEncapsulation} from '@angular/core';
import { SwiperComponent } from "swiper/angular";
import Swiper from 'swiper';

@Component({
  selector: 'app-about',
  template: `
    <swiper
        direction="vertical"
    >
      <ng-template  swiperSlide >
        <div class="slide-wrapper">
            <img src="../../../assets/image/slider-image.jpg" alt="">
          <div class="about-text">
            <div class="about-logo">
                <svg height="2.708vw" viewBox="0 0 60 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd"
                      d="M59.3689 0C59.7139 0 60 0.281934 60 0.629353V38.3743C60 38.7162 59.7139 39 59.3689 39H51.2391C50.8904 39 50.6079 38.7162 50.6079 38.3743V0.629353C50.6079 0.281934 50.8904 0 51.2391 0H59.3689ZM24.0926 0C30.2253 0 36.6369 0.285574 39.798 3.50511C42.909 6.6736 43.2446 12.9812 43.2573 19.1066L43.2576 38.3743C43.2576 38.7162 42.9752 39 42.6265 39H34.5003C34.1516 39 33.8673 38.7162 33.8673 38.3743V18.7751C33.8584 15.3537 33.6653 11.8377 31.931 10.0679C30.4381 8.5454 27.6524 8.19617 24.7559 8.12341H10.0232C9.67639 8.12341 9.39388 8.40716 9.39388 8.74912V38.3743C9.39388 38.7162 9.10782 39 8.76095 39H0.627567C0.280704 39 0 38.7162 0 38.3743V0.629353C0 0.281934 0.280704 0 0.627567 0H24.0926ZM25.9128 15.0318C26.2578 15.0318 26.5385 15.3137 26.5385 15.6575V38.3743C26.5385 38.7162 26.2578 39 25.9128 39H17.3735C17.0231 39 16.7406 38.7162 16.7406 38.3743V15.6575C16.7406 15.3137 17.0231 15.0318 17.3735 15.0318H25.9128Z"
                      fill="#FF4C0D"/>
              </svg>
            </div>
            <div class="titles">
              <h1>О бренде Xiaomi</h1>
              <p>Компания Xiaomi была основана предпринимателем
                Лей Цзюнем в 2010 году под девизом - «Инновации
                для всех». Мы верим, что высококачественные продукты и передовые
                технологии должны быть доступны каждому.</p>
            </div>
          </div>
        </div>
      </ng-template>
<ng-template  swiperSlide >
        <div class="slide-wrapper">
            <img src="../../../assets/image/slider-image.jpg" alt="">
          <div class="about-text">
            <div class="about-logo">
                <svg height="2.708vw" viewBox="0 0 60 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd"
                      d="M59.3689 0C59.7139 0 60 0.281934 60 0.629353V38.3743C60 38.7162 59.7139 39 59.3689 39H51.2391C50.8904 39 50.6079 38.7162 50.6079 38.3743V0.629353C50.6079 0.281934 50.8904 0 51.2391 0H59.3689ZM24.0926 0C30.2253 0 36.6369 0.285574 39.798 3.50511C42.909 6.6736 43.2446 12.9812 43.2573 19.1066L43.2576 38.3743C43.2576 38.7162 42.9752 39 42.6265 39H34.5003C34.1516 39 33.8673 38.7162 33.8673 38.3743V18.7751C33.8584 15.3537 33.6653 11.8377 31.931 10.0679C30.4381 8.5454 27.6524 8.19617 24.7559 8.12341H10.0232C9.67639 8.12341 9.39388 8.40716 9.39388 8.74912V38.3743C9.39388 38.7162 9.10782 39 8.76095 39H0.627567C0.280704 39 0 38.7162 0 38.3743V0.629353C0 0.281934 0.280704 0 0.627567 0H24.0926ZM25.9128 15.0318C26.2578 15.0318 26.5385 15.3137 26.5385 15.6575V38.3743C26.5385 38.7162 26.2578 39 25.9128 39H17.3735C17.0231 39 16.7406 38.7162 16.7406 38.3743V15.6575C16.7406 15.3137 17.0231 15.0318 17.3735 15.0318H25.9128Z"
                      fill="#FF4C0D"/>
              </svg>
            </div>
            <div class="titles">
              <h1>О бренде Xiaomi</h1>
              <p>Компания Xiaomi была основана предпринимателем
                Лей Цзюнем в 2010 году под девизом - «Инновации
                для всех». Мы верим, что высококачественные продукты и передовые
                технологии должны быть доступны каждому.</p>
            </div>
          </div>
        </div>
      </ng-template>
    </swiper>

  `,
  styleUrls: ['./about.component.scss'],
  encapsulation: ViewEncapsulation.None
})
export class AboutComponent implements OnInit {

  constructor() {
  }

  ngOnInit(): void {
  }

}
